Catalogs/ВидыПредоставляемыхСотрудникамСправок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыПредоставляемыхСотрудникамСправок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСправки</Name>
					<Comment>Представление для кабинета сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСправокСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыШаблоновСправокСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПредоставляемыхСотрудникамСправокПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразецСправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПредоставляемыхСотрудникамСправокПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыШаблоновСправокСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыШаблоновСправокСотрудникам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрисоединенныйОфисныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МакетПечатнойФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйМакет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыПредоставляемыхСотрудникамСправокПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыПредоставляемыхСотрудникамСправокПрисоединенныеФайлы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПредоставляемыхСотрудникамСправок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьЭлектронныеПодписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаПодписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>260</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомуВыданСертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подпись</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановившийПодпись</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьСертификатыШифрования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыПредоставляемыхСотрудникамСправок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// @strict-types

//@skip-check method-param-value-type
//@skip-check invocation-parameter-type-intersect

#Область ОбработчикиСобытийФормы

&НаСервере
//@skip-check property-return-type
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	//@skip-check variable-value-type
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель"; 
	ПараметрыГиперссылки.Владелец = "Объект.Ссылка";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	Если Не ЗначениеЗаполнено(ВидСправкиСсылка) Тогда
		ВидСправкиСсылка = Справочники.ВидыПредоставляемыхСотрудникамСправок.ПолучитьСсылку();
	КонецЕсли;
	
	ЗаполнитьКомандыПечатиНаСервере();
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ВидСправкиСсылка = ТекущийОбъект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(ВидСправкиСсылка);
	ИначеЕсли ТребуетсяОбновитьОбразец Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбновитьОбразец", Истина);
		ТребуетсяОбновитьОбразец = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ОбразецСправки) Тогда
		ПрисоединенныйФайлНаСервереУдалить(Объект.ОбразецСправки, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ВидСправкиСсылка = ТекущийОбъект.Ссылка;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// СтандартныеПодсистемы.РаботаСФайлами
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка);
		
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура ВидШаблонаПриИзменении(Элемент)

	Если Объект.ВидШаблона = ПредопределенноеЗначение(
		"Перечисление.ВидыШаблоновСправокСотрудникам.МакетПечатнойФормы") Тогда
	ИначеЕсли Объект.ВидШаблона = ПредопределенноеЗначение(
		"Перечисление.ВидыШаблоновСправокСотрудникам.ПроизвольныйМакет") Тогда
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			СтрШаблон(НСтр("ru = 'Неизвестный вид шаблона справки %1'"), Объект.ВидШаблона),
			"Справочник.ФормаЭлемента.ВидШаблонаПриИзменении");
	КонецЕсли;
	
	ТребуетсяОбновитьОбразец = Истина;
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтаФорма, , );

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ОписаниеНачалоВыбораЗавершение", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, Объект.Описание, НСтр("ru = 'Описание справки'"), , Истина);
	
КонецПроцедуры

// Параметры:
//  Строка - Строка
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура ОписаниеНачалоВыбораЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка <> Неопределено Тогда
		Объект.Описание = Строка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМакетаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура МакетПечатнойФормыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораМакета", ЭтотОбъект);
	СписокМакетов.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите макет'"),
		СписокМакетов.НайтиПоЗначению(Объект.ИдентификаторМакета));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМакетаОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.ОбразецСправки) Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ПредставлениеМакетаОчисткаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Внимание! Образец справки будет удален. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе
		Объект.ИдентификаторМакета = "";
		УстановитьОтображениеЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМакетаОчисткаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеМакета = "";
	Объект.ИдентификаторМакета = "";
	ПрисоединенныйФайлНаСервереУдалить(Объект.ОбразецСправки);
	Объект.ОбразецСправки = 
		ПредопределенноеЗначение("Справочник.ВидыПредоставляемыхСотрудникамСправокПрисоединенныеФайлы.ПустаяСсылка");
	Записать();
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.РаботаСФайлами
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура РедактироватьШаблон(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед редактированием шаблона необходимо записать справку'"));
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ШаблонСправки) Тогда
		Оповещение = Новый ОписаниеОповещения("РедактироватьШаблонЗавершить", ЭтотОбъект);
		РаботаСФайламиКлиент.ПолучитьПрисоединенныйФайл(Оповещение, Объект.ШаблонСправки, УникальныйИдентификатор);
	Иначе
		ОткрытьФормуРедактированияМакета(Новый ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - Структура:
//   * ПолноеИмяФайла - Строка - полное имя файла (с путем).
//   * ОписаниеОшибки - Строка - текст ошибки, если получить файл не удалось.
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура РедактироватьШаблонЗавершить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПрочитатьШаблонНаСервере(ТабличныйДокумент, Результат.ПолноеИмяФайла);
	ОткрытьФормуРедактированияМакета(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОбразец(Команда)
	
	СформироватьСохранитьОбразец();
	
	Если ЗначениеЗаполнено(Объект.ОбразецСправки) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Образец справки сформирован.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьШабон(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ШаблонСправки) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("УдалитьШабонЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Внимание! Шаблон справки будет удален. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьШабонЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПрисоединенныйФайлНаСервереУдалить(Объект.ШаблонСправки);
	ПрисоединенныйФайлНаСервереУдалить(Объект.ОбразецСправки);
	
	Объект.ШаблонСправки = 
		ПредопределенноеЗначение("Справочник.ВидыПредоставляемыхСотрудникамСправокПрисоединенныеФайлы.ПустаяСсылка");
	Объект.ОбразецСправки = 
		ПредопределенноеЗначение("Справочник.ВидыПредоставляемыхСотрудникамСправокПрисоединенныеФайлы.ПустаяСсылка");
		
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОбразец(Команда)
	
	Если ТребуетсяОбновитьОбразец Или Не ЗначениеЗаполнено(Объект.ОбразецСправки) Тогда
		СформироватьСохранитьОбразец(Истина);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОбразецСправки) Тогда
		Возврат;
	КонецЕсли;

	РаботаСФайламиКлиент.ОткрытьФайл(РаботаСФайламиКлиент.ДанныеФайла(Объект.ОбразецСправки, УникальныйИдентификатор));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьКомандыПечатиНаСервере();

	КомандыПечати = Справочники.ВидыПредоставляемыхСотрудникамСправок.ДоступныеКомандыПечати();
	Для Каждого КомандаПечати Из КомандыПечати Цикл
		//@skip-check property-return-type
		СписокМакетов.Добавить(КомандаПечати.Идентификатор, КомандаПечати.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеЭлементов()
	
	ВидШаблонаМакетПечатнойФормыПредставление = НСтр("ru = 'Макет печатной формы'");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Предупреждение", "Видимость", Ложь);
	
	Если Объект.ВидШаблона = Перечисления.ВидыШаблоновСправокСотрудникам.МакетПечатнойФормы Тогда
		
		ВидШаблонаМакетПечатнойФормыПредставление = НСтр("ru = 'Макет печатной формы:'");
		
		ПредставлениеМакета = "";
		Если ЗначениеЗаполнено(Объект.ИдентификаторМакета) Тогда
			ЭлементСписка = СписокМакетов.НайтиПоЗначению(Объект.ИдентификаторМакета);
			Если ЭлементСписка <> Неопределено Тогда
				ПредставлениеМакета = ЭлементСписка.Представление;
			КонецЕсли;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоказатьОбразец", "Видимость",
			ЗначениеЗаполнено(Объект.ИдентификаторМакета));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеМакета", "Видимость",
			Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКомандыПроизвольныйМакет",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособФормирования", "Доступность",
			ЗначениеЗаполнено(Объект.ИдентификаторМакета));
			
		УстановитьВидимостьПредупреждения();
			
	ИначеЕсли Объект.ВидШаблона = Перечисления.ВидыШаблоновСправокСотрудникам.ПроизвольныйМакет Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоказатьОбразец", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеМакета", "Видимость",
			Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКомандыПроизвольныйМакет",
			"Видимость", Истина);
			
		Если Не ЗначениеЗаполнено(Объект.ШаблонСправки) Тогда
			РедактироватьШаблонЗаголовок = НСтр("ru = 'Создать шаблон'");
		Иначе
			РедактироватьШаблонЗаголовок = НСтр("ru = 'Редактировать'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РедактироватьШаблон", "Заголовок",
			РедактироватьШаблонЗаголовок);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдалитьШабон", "Видимость",
			ЗначениеЗаполнено(Объект.ШаблонСправки));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоказатьОбразец1", "Видимость",
			ЗначениеЗаполнено(Объект.ШаблонСправки));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособФормирования", "Доступность",
			ЗначениеЗаполнено(Объект.ШаблонСправки));
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			СтрШаблон(НСтр("ru = 'Неизвестный вид шаблона справки %1'"), Объект.ВидШаблона),
			"Справочник.ФормаЭлемента.УстановитьОтображениеЭлементов");
			
	КонецЕсли;
	
	Элементы.ВидШаблонаМакетПечатнойФормы.СписокВыбора[0].Представление = ВидШаблонаМакетПечатнойФормыПредставление;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеСправки", "Видимость",
		ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника"));

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредупреждения()
	
	ПохожиеВидыСправок = ПохожиеВидыСправок(Объект.ИдентификаторМакета);
	КоличествоПохожихСправок = ПохожиеВидыСправок.Количество();
	
	Если КоличествоПохожихСправок = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Предупреждение", "Видимость", Истина);
	
	ЧастиПредупреждения = Новый Массив;
	
	Если КоличествоПохожихСправок = 1 Тогда
		ЧастиПредупреждения.Добавить("<span style=""color: ПоясняющийОшибкуТекст"">Вид справки с таким макетом уже существует </span>");
		ЧастиПредупреждения.Добавить("<a style=""color: ПоясняющийОшибкуТекст"" href=""%1"">%2</a>");
		ТекстПредупреждения = СтрСоединить(ЧастиПредупреждения);
		
		Предупреждение = СтроковыеФункции.ФорматированнаяСтрока(ТекстПредупреждения,
			ПолучитьНавигационнуюСсылку(ПохожиеВидыСправок[0]), Строка(ПохожиеВидыСправок[0]));
	ИначеЕсли КоличествоПохожихСправок = 2 Тогда
		ЧастиПредупреждения.Добавить("<span style=""color: ПоясняющийОшибкуТекст"">Виды справок с таким макетом уже существуют </span>");
		ЧастиПредупреждения.Добавить("<a style=""color: ПоясняющийОшибкуТекст"" href=""%1"">%2</a>");
		ЧастиПредупреждения.Добавить("<span style=""color: ПоясняющийОшибкуТекст""> и </span>");
		ЧастиПредупреждения.Добавить("<a style=""color: ПоясняющийОшибкуТекст"" href=""%3"">%4</a>");
		ТекстПредупреждения = СтрСоединить(ЧастиПредупреждения);
		
		Предупреждение = СтроковыеФункции.ФорматированнаяСтрока(ТекстПредупреждения,
			ПолучитьНавигационнуюСсылку(ПохожиеВидыСправок[0]), Строка(ПохожиеВидыСправок[0]),
			ПолучитьНавигационнуюСсылку(ПохожиеВидыСправок[1]), Строка(ПохожиеВидыСправок[1]));
	Иначе
		ЧастиПредупреждения.Добавить("<span style=""color: ПоясняющийОшибкуТекст"">Виды справок с таким макетом уже существуют </span>");
		ЧастиПредупреждения.Добавить("<a style=""color: ПоясняющийОшибкуТекст"" href=""%1"">%2</a>");
		ЧастиПредупреждения.Добавить("<span style=""color: ПоясняющийОшибкуТекст"">, </span>");
		ЧастиПредупреждения.Добавить("<a style=""color: ПоясняющийОшибкуТекст"" href=""%3"">%4</a>");
		ЧастиПредупреждения.Добавить("<span style=""color: ПоясняющийОшибкуТекст""> и еще %5</span>");
		ТекстПредупреждения = СтрСоединить(ЧастиПредупреждения);
		
		Предупреждение = СтроковыеФункции.ФорматированнаяСтрока(ТекстПредупреждения,
			ПолучитьНавигационнуюСсылку(ПохожиеВидыСправок[0]), Строка(ПохожиеВидыСправок[0]),
			ПолучитьНавигационнуюСсылку(ПохожиеВидыСправок[1]), Строка(ПохожиеВидыСправок[1]),
			КоличествоПохожихСправок - 2);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторМакета - Строка - 
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ВидыПредоставляемыхСотрудникамСправок- 
&НаСервере
Функция ПохожиеВидыСправок(ИдентификаторМакета)
	
	ПохожиеВидыСправок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПредоставляемыхСотрудникамСправок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыПредоставляемыхСотрудникамСправок КАК ВидыПредоставляемыхСотрудникамСправок
		|ГДЕ
		|	НЕ ВидыПредоставляемыхСотрудникамСправок.ПометкаУдаления
		|	И ВидыПредоставляемыхСотрудникамСправок.ИдентификаторМакета = &ИдентификаторМакета
		|	И ВидыПредоставляемыхСотрудникамСправок.Ссылка <> &Ссылка
		|	И ИдентификаторМакета <> &ПустаяСтрока";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторМакета", ИдентификаторМакета);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ПохожиеВидыСправок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат ПохожиеВидыСправок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВариантОтчета(ИмяВарианта)
	
	ИдентификаторОтчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Отчеты.ПечатнаяФормаСправкаПредоставляемаяСотруднику);
	
	ВариантОтчета = ВариантыОтчетов.ВариантОтчета(ИдентификаторОтчета, ИмяВарианта);

	Если ВариантОтчета = Неопределено Тогда
		ВариантОтчета = НовыйВариантОтчета(ИдентификаторОтчета, ИмяВарианта);
	КонецЕсли;
	
	Возврат ВариантОтчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйВариантОтчета(ИдентификаторОтчета, ИмяВарианта)
	
	СхемаКомпоновки = Отчеты.ПечатнаяФормаСправкаПредоставляемаяСотруднику.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//@skip-check property-return-type
	//@skip-check dynamic-access-method-not-found
	Настройки = СхемаКомпоновки.ВариантыНастроек.Найти("Основной").Настройки; // НастройкиКомпоновкиДанных
	
	НастройкиВариантаОтчета = Новый Структура;
	НастройкиВариантаОтчета.Вставить("Настройки", Настройки);
	НастройкиВариантаОтчета.Вставить("ПользовательскиеНастройкиКД");
	
	НовыйВариантОтчета = Справочники.ВариантыОтчетов.СоздатьЭлемент();
	НовыйВариантОтчета.Отчет = ИдентификаторОтчета;
	НовыйВариантОтчета.Настройки = Новый ХранилищеЗначения(НастройкиВариантаОтчета);
	НовыйВариантОтчета.КлючВарианта = ИмяВарианта;
	НовыйВариантОтчета.Наименование = ИмяВарианта;
	НовыйВариантОтчета.Записать();
	
	Возврат НовыйВариантОтчета.Ссылка;
	
КонецФункции

// Параметры:
//  Результат - Структура:
//   * МакетПечатнойФормы - ТабличныйДокумент
//  ДополнительныеПараметры - Произвольный
&НаСервере
Процедура РедактироватьЗавершитьНаСервере(Результат, ДополнительныеПараметры) 
	
	ШаблонСправки = Результат.МакетПечатнойФормы;
	СамообслуживаниеСотрудников.СохранитьТабличныйДокументВПрисоединенномФайле(Объект, ВидСправкиСсылка, ШаблонСправки,
		"ШаблонСправки", НСтр("ru = 'Шаблон справки'"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьШаблонНаСервере(ТабличныйДокумент, ИмяФайла)
	ТабличныйДокумент.Прочитать(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияМакета(ТабличныйДокумент)
	
	ПараметрыРедактирования = Новый Структура;
	ПараметрыРедактирования.Вставить("МакетПечатнойФормы", ТабличныйДокумент);
	ПараметрыРедактирования.Вставить("ВариантОтчета", ВариантОтчета("Основной"));
	ПараметрыРедактирования.Вставить("Заголовок", Объект.Наименование);
	ПараметрыРедактирования.Вставить("НеОтображатьКомандуПредварительныйПросмотр");
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуРедактированияМакетаЗавершить", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.НастраиваемыеПечатныеФормыЗарплатаКадры.Форма.ФормаНастройкиПечатнойФормы",
		ПараметрыРедактирования, , , , , Оповещение);
		
КонецПроцедуры

// Параметры:
//  Результат - Структура:
//   * ВыбранныеПоля - Массив из Структура -
//   * МакетПечатнойФормы - ТабличныйДокумент -
//   * Результат - Булево -
//  ДополнительныеПараметры - Произвольный -
&НаКлиенте
Процедура ОткрытьФормуРедактированияМакетаЗавершить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	РедактироватьЗавершитьНаСервере(Результат, ДополнительныеПараметры);

	УстановитьОтображениеЭлементов();
	ОповеститьОбИзменении(Объект.Ссылка);
	
	ТребуетсяОбновитьОбразец = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

// Параметры:
//  ВыбранныйЭлемент - ЭлементСпискаЗначений,Неопределено
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура ПослеВыбораМакета(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check statement-type-change
	Объект.ИдентификаторМакета = ВыбранныйЭлемент.Значение;
	ПредставлениеМакета = ВыбранныйЭлемент.Представление;
	ТребуетсяОбновитьОбразец = Истина;
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСохранитьОбразец(ПоказатьОбразец = Ложь)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПоказатьПредупреждение", Истина);
	ДополнительныеПараметры.Вставить("ПоказатьОбразец", ПоказатьОбразец);
	
	Если Параметры.Ключ.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("СформироватьСохранитьОбразецЗавершение", ЭтотОбъект,
			ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Элемент будет записан. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		СформироватьСохранитьОбразецЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//  Результат - см. ДлительныеОперации.ВыполнитьФункцию
//  ДополнительныеПараметры - Структура
&НаКлиенте
Процедура СформироватьСохранитьОбразецЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОбразецНаСервере();

	Если Не ЗначениеЗаполнено(Объект.ОбразецСправки)
		И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПоказатьПредупреждение", Ложь) Тогда
			
		ТекстПредупреждения =  НСтр(
			"ru = 'Автоматическое формирование образца справки для выбранной печатной формы не реализовано.
			| Обратитесь к разработчику печатной формы.'");
		ПоказатьПредупреждение(, СтрЗаменить(ТекстПредупреждения, Символы.ПС, ""));
		Возврат;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПоказатьОбразец", Ложь) Тогда
		РаботаСФайламиКлиент.ОткрытьФайл(РаботаСФайламиКлиент.ДанныеФайла(Объект.ОбразецСправки,
			УникальныйИдентификатор));
	КонецЕсли;

	УстановитьОтображениеЭлементов();
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОбразецНаСервере()
	
	ВидСправкиОбъект = РеквизитФормыВЗначение("Объект");
	ВидСправкиОбъект.ДополнительныеСвойства.Вставить("ОбновитьОбразец", Истина);
	ВидСправкиОбъект.Записать();
	ЗначениеВРеквизитФормы(ВидСправкиОбъект, "Объект");
		
	ТребуетсяОбновитьОбразец = Ложь;
	Модифицированность = Ложь;
	
КонецПроцедуры

// См. СамообслуживаниеСотрудников.УдалитьПрисоединенныйФайл
&НаСервереБезКонтекста
Процедура ПрисоединенныйФайлНаСервереУдалить(ПрисоединенныйФайл, УстановитьПометку = Истина)
	
	СамообслуживаниеСотрудников.УдалитьПрисоединенныйФайл(ПрисоединенныйФайл, УстановитьПометку);
	
КонецПроцедуры

#КонецОбласти
